src/test/resources/ws/download-request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:protocol="http://soap.lab/protocol">
  <SOAP-ENV:Header>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <protocol:DownloadFileRequest>
      <protocol:fileIds>1</protocol:fileIds>
      <protocol:fileIds>2</protocol:fileIds>
      <protocol:fileIds>3</protocol:fileIds>
    </protocol:DownloadFileRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
